tutorials/case330-compressible-He-channel/0/fluid/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | multiSpeciesRegionFoam
   \\    /   O peration     | Case:     case330-compressible-He-channel / fluid
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0/fluid";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Isothermal He at 700 K.  No heat sources, so T ≈ const.
// D(T) uses Ea=0 → D is constant regardless of T variations.

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 700;

boundaryField
{
    fluid_bottom
    {
        type        fixedValue;
        value       uniform 700;
    }

    fluid_top
    {
        type        zeroGradient;
    }

    fluid_centerline
    {
        type        zeroGradient;
    }

    fluid_to_solid
    {
        type        zeroGradient;
    }

    sides
    {
        type        empty;
    }
}

// ************************************************************************* //
