tutorials/case330-compressible-He-channel/0/fluid/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | multiSpeciesRegionFoam
   \\    /   O peration     | Case:     case330-compressible-He-channel / fluid
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0/fluid";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Thermodynamic pressure [Pa].  Reference: 1 atm = 101325 Pa at outlet.
// compressibleSpeciesFluid uses absolute pressure (not kinematic).

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    fluid_bottom
    {
        type        zeroGradient;
    }

    fluid_top
    {
        type        fixedValue;
        value       uniform 101325;    // 1 atm outlet reference pressure
    }

    fluid_centerline
    {
        type        zeroGradient;
    }

    fluid_to_solid
    {
        type        zeroGradient;
    }

    sides
    {
        type        empty;
    }
}

// ************************************************************************* //
