tutorials/case330-compressible-He-channel/constant/fluid/momentumTransport
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | multiSpeciesRegionFoam
   \\    /   O peration     | Case:     case330-compressible-He-channel / fluid
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant/fluid";
    object      momentumTransport;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Re ≈ 0.24 (U=0.01 m/s, Dh=10 mm, ν=4.16e-4 m²/s) — deeply laminar.

simulationType  laminar;

// ************************************************************************* //
