tutorials/case330-compressible-He-channel/constant/fluid/physicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | multiSpeciesRegionFoam
   \\    /   O peration     | Case:     case330-compressible-He-channel / fluid
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant/fluid";
    object      physicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Helium (He-4) at 700 K, 1 atm (101325 Pa).
//
// Properties:
//   M       = 4.003 g/mol
//   rho     = P·M/(R·T) ≈ 101325·0.004003/(8.314·700) = 0.0697 kg/m³  (rhoConst)
//   mu      = 2.9e-5 Pa·s  (viscosity at 700 K)
//   nu      = mu/rho = 2.9e-5/0.0697 = 4.16e-4 m²/s
//   Cp      = 5193 J/(kg·K)  (monatomic ideal gas)
//   Cv      = Cp - R/M = 5193 - 8314/4.003 = 3116 J/(kg·K)
//   kappa   = 0.22 W/(m·K)
//   Pr      = mu·Cp/kappa = 2.9e-5 × 5193 / 0.22 = 0.684
//
// Re = U·Dh/ν = 0.01·0.010/4.16e-4 ≈ 0.24  (highly viscous flow at low Re)
//
// compressibleSpeciesFluid reads heRhoThermo format.

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    thermo          eConst;
    equationOfState rhoConst;
    specie          specie;
    energy          sensibleInternalEnergy;
}

mixture
{
    specie
    {
        molWeight   4.003;      // g/mol
    }
    equationOfState
    {
        rho         0.0697;     // kg/m³  (constant density at 700 K, 1 atm)
    }
    thermodynamics
    {
        Cv          3116;       // J/(kg·K)
        Hf          0;          // J/kg  (zero heat of formation)
    }
    transport
    {
        mu          2.9e-5;     // Pa·s
        Pr          0.684;      // dimensionless
    }
}

// ************************************************************************* //
