tutorials/case330-compressible-He-channel/constant/fluid/thermophysicalTransport
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | multiSpeciesRegionFoam
   \\    /   O peration     | Case:     case330-compressible-He-channel / fluid
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant/fluid";
    object      thermophysicalTransport;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Fourier heat conduction model for laminar compressible flow.
// kappa is derived from Pr and mu specified in physicalProperties.

laminar
{
    model   Fourier;
}

// ************************************************************************* //
