tutorials/case330-compressible-He-channel/constant/solid/physicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | multiSpeciesRegionFoam
   \\    /   O peration     | Case:     case330-compressible-He-channel / solid
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant/solid";
    object      physicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// SS316 stainless steel at 700 K.
// Properties: ρ = 7960 kg/m³,  Cp = 530 J/(kg·K),  k = 21 W/(m·K).
// Identical to case329-flibe-channel/constant/solid/physicalProperties.

thermoType
{
    type            heSolidThermo;
    mixture         pureMixture;
    transport       constIsoSolid;
    thermo          eConst;
    equationOfState rhoConst;
    specie          specie;
    energy          sensibleInternalEnergy;
}

mixture
{
    specie
    {
        molWeight   56;
    }
    transport
    {
        kappa       21;
    }
    thermodynamics
    {
        hf          0;
        Cv          530;
    }
    equationOfState
    {
        rho         7960;
    }
}

// ************************************************************************* //
