tutorials/case330-compressible-He-channel/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | multiSpeciesRegionFoam
   \\    /   O peration     | Case:     case330-compressible-He-channel
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// 2-D geometry for He gas channel + SS316 permeation barrier.
//
// Coordinate system:
//   x: 0 → 5 mm   He half-channel  (symmetry at x=0, solid at x=5 mm)
//   x: 5 → 7 mm   SS316 slab
//   y: 0 → 50 mm  channel height (flow direction: +y upward)
//   z: 0 → 1 mm   1 cell, empty (2-D)
//
// Operating conditions (He at 700 K, 1 atm):
//   ν = 4.16e-4 m²/s,  U_in = 0.01 m/s,  Re = U·Dh/ν ≈ 0.24  (laminar)
//   Dh = 2·W = 10 mm  (parallel-plate hydraulic diameter)
//
// Cell counts:
//   fluid : Nx=25 (Δx=0.20 mm),  Ny=100 (Δy=0.50 mm)
//   solid : Nx=10 (Δx=0.20 mm),  Ny=100
//
// splitMeshRegions -cellZones creates coupled patches:
//   fluid_to_solid / solid_to_fluid

convertToMeters 1e-3;   // coordinates in mm

vertices
(
    ( 0   0  0)   //  0 — (x=0,   y=0,  z=0)
    ( 5   0  0)   //  1 — (x=W,   y=0,  z=0)
    ( 7   0  0)   //  2 — (x=W+d, y=0,  z=0)
    ( 0  50  0)   //  3 — (x=0,   y=L,  z=0)
    ( 5  50  0)   //  4 — (x=W,   y=L,  z=0)
    ( 7  50  0)   //  5 — (x=W+d, y=L,  z=0)

    ( 0   0  1)   //  6 — (x=0,   y=0,  z=1)
    ( 5   0  1)   //  7 — (x=W,   y=0,  z=1)
    ( 7   0  1)   //  8 — (x=W+d, y=0,  z=1)
    ( 0  50  1)   //  9 — (x=0,   y=L,  z=1)
    ( 5  50  1)   // 10 — (x=W,   y=L,  z=1)
    ( 7  50  1)   // 11 — (x=W+d, y=L,  z=1)
);

blocks
(
    hex (0 1 4 3  6 7 10 9)  fluid  (25 100 1)  simpleGrading (1 1 1)
    hex (1 2 5 4  7 8 11 10) solid  (10 100 1)  simpleGrading (1 1 1)
);

boundary
(
    fluid_bottom
    {
        type    patch;
        faces   ( (0 1 7 6) );      // y = 0, fluid inlet
    }
    fluid_top
    {
        type    patch;
        faces   ( (3 9 10 4) );     // y = 50 mm, fluid outlet
    }
    fluid_centerline
    {
        type    patch;
        faces   ( (0 6 9 3) );      // x = 0, symmetry / centerline
    }
    solid_bottom
    {
        type    patch;
        faces   ( (1 2 8 7) );      // y = 0, solid axial end
    }
    solid_top
    {
        type    patch;
        faces   ( (4 10 11 5) );    // y = 50 mm, solid axial end
    }
    solid_outer
    {
        type    patch;
        faces   ( (2 5 11 8) );     // x = 7 mm, outer SS316 surface (vacuum BC)
    }
    sides
    {
        type    empty;
        faces
        (
            (0 3 4 1)    // fluid z = 0
            (6 7 10 9)   // fluid z = 1 mm
            (1 4 5 2)    // solid z = 0
            (7 8 11 10)  // solid z = 1 mm
        );
    }
);

// ************************************************************************* //
