tutorials/case330-compressible-He-channel/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | multiSpeciesRegionFoam
   \\    /   O peration     | Case:     case330-compressible-He-channel
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// He gas vertical channel with distributed H2 source → SS316 permeation.
//
// Two-region case:
//   fluid  — He gas at 700 K, 1 atm (compressibleSpeciesFluid: PIMPLE U/p + e + C_H2)
//   solid  — SS316 stainless steel (speciesSolid: diffusion only)
//
// Purpose: validate that compressibleSpeciesFluid gives the same permeation
// flux as the incompressible speciesFluid (case329-flibe-channel) when the
// same D, Ks, source, and velocity are used.
//
// Hydrogen produced uniformly at rate S = 1e-5 mol/(m³·s).
// Advected upward by plug flow (U_in = 0.01 m/s) and diffused toward the wall.
// Permeates through SS316 via Sieverts-law interface; exits at outer surface
// (C = 0, vacuum BC).

application     foamMultiRun;

startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         2000;

deltaT          1;

writeControl    runTime;
writeInterval   200;
purgeWrite      0;
writeFormat     ascii;
writePrecision  8;

runTimeModifiable yes;

regionSolvers
{
    fluid   compressibleSpeciesFluid;
    solid   speciesSolid;
}

libs
(
    "libspeciesTransport.so"
    "libspeciesSolid.so"
    "libcompressibleSpeciesFluid.so"
    "libspeciesCoupling.so"
);

// ************************************************************************* //
