tutorials/case330-compressible-He-channel/system/fluid/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | multiSpeciesRegionFoam
   \\    /   O peration     | Case:     case330-compressible-He-channel / fluid
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// He channel: Re ≈ 0.24 (laminar).  Species Peclet Pe ≈ 1000 → upwind for C.
// compressibleSpeciesFluid solves sensible internal energy (e) instead of T.

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
    grad(U)         Gauss linear;
    grad(e)         Gauss linear;
}

divSchemes
{
    default         none;
    div(phi,U)          Gauss linearUpwind grad(U);
    div(phi,e)          Gauss linearUpwind grad(e);
    div(phi,K)          Gauss linear;
    div(phi,(p|rho))    Gauss linear;
    div(phiU,C_H2)      Gauss upwind;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

// ************************************************************************* //
